In [1]:
import pandas as pd

In [ ]:
# 데이터 프레임은 col, 시리즈는 row 위주 (컬럼이 하나짜리)

In [3]:
Inflation = pd.Series((2.2,3.4,2.8,1.6,2.3,2.7,3.4,3.2,2.8,3.8,-0.4,1.6,3.2,2.1,1.6,1.5))

In [5]:
Inflation.head(2)

0    2.2
1    3.4
dtype: float64

In [6]:
len(Inflation)

16

In [9]:
# 인덱스의 이름은 Year, 컬럼명은 %로 주기
Inflation.index.name = 'Year'
Inflation.name = '%'
Inflation.head(2)

Year
0    2.2
1    3.4
Name: %, dtype: float64

In [11]:
Inflation.reset_index()

    Year    %
0      0  2.2
1      1  3.4
2      2  2.8
3      3  1.6
4      4  2.3
5      5  2.7
6      6  3.4
7      7  3.2
8      8  2.8
9      9  3.8
10    10 -0.4
11    11  1.6
12    12  3.2
13    13  2.1
14    14  1.6
15    15  1.5

In [12]:
# 데이터 타입은 시리즈
type(Inflation)

pandas.core.series.Series

In [66]:
# 교재 예제 가져옴 (인덱스를 State로 잡아서 할거라고 미리 정의하기)
alco2009 = pd.read_csv('book/niaaa-report2009.csv', index_col = 'State')
alco2009.head()

            Beer  Wine  Spirits
State
Alabama     1.20  0.22     0.58
Alaska      1.31  0.54     1.16
Arizona     1.19  0.38     0.74
Arkansas    1.07  0.17     0.60
California  1.05  0.55     0.73

In [67]:
alco2009.index[0]

'Alabama'

In [69]:
# S로 시작하는 값들 갖고오기
[state for state in alco2009.index if state[0]=='S']

['South Carolina', 'South Dakota']

In [72]:
# 리스트에 목록 하나 추가
s_state = [state for state in alco2009.index if state[0]=='S']+["Samoa"]
s_state

['South Carolina', 'South Dakota', 'Samoa']

In [80]:
# water 컬럼 추가 (기존에 존재하는 alco2009의 컬럼에 water추가됨)
drinks = list(alco2009.columns)+["water"]
drinks

['Beer', 'Wine', 'Spirits', 'water']

In [83]:
# 리인덱싱 (인덱스가 넘치는건 상관없음,but 작아지는건 X)
nan_alco = alco2009.reindex(s_state, columns=drinks)
nan_alco.tail()

                Beer  Wine  Spirits  water
State
South Carolina  1.36  0.24     0.77    NaN
South Dakota    1.53  0.22     0.88    NaN
Samoa            NaN   NaN      NaN    NaN

In [110]:
# 누락데이터
sp = nan_alco.Spirits
clean = sp.notnull()
clean

State
South Carolina     True
South Dakota       True
Samoa             False
Name: Spirits, dtype: bool

In [117]:
# -붙인 이유가 무엇일까.. 다시 찾아보기
sp[-clean] = sp[clean].mean()
sp[-clean]

State
Samoa    0.825
Name: Spirits, dtype: float64

In [115]:
sp[clean].mean()

0.825

In [118]:
nan_alco.fillna(0)

                Beer  Wine  Spirits  water
State
South Carolina  1.36  0.24    0.770    0.0
South Dakota    1.53  0.22    0.880    0.0
Samoa           0.00  0.00    0.825    0.0

In [ ]:
# =====================================================================================================

In [99]:
alco = pd.read_csv('book/niaaa-report.csv',index_col=['State',])

In [86]:
alco.head(1)

         Year  Beer  Wine  Spirits
State
Alabama  1977  0.99  0.13     0.84

In [100]:
# 리인덱싱
alco.reset_index().set_index(["State","Year"]).head()

              Beer  Wine  Spirits
State   Year
Alabama 1977  0.99  0.13     0.84
        1978  0.98  0.12     0.88
        1979  0.98  0.12     0.84
        1980  0.96  0.16     0.74
        1981  1.00  0.19     0.73

In [104]:
tail_alco = alco.stack()
tail_alco.head(3)

State
Alabama  Year    1977.00
         Beer       0.99
         Wine       0.13
dtype: float64

In [105]:
wide_alco = alco.unstack()
wide_alco.head(3)

      State
Year  Alabama    1977.0
      Alabama    1978.0
      Alabama    1979.0
dtype: float64

In [ ]:
# =====================================================================================================

In [93]:
# 일단 파일만 갖고오고 인덱스는 나중에 정의하기
alco2009 = pd.read_csv('book/niaaa-report2009.csv')
alco2009.head()

        State  Beer  Wine  Spirits
0     Alabama  1.20  0.22     0.58
1      Alaska  1.31  0.54     1.16
2     Arizona  1.19  0.38     0.74
3    Arkansas  1.07  0.17     0.60
4  California  1.05  0.55     0.73

In [43]:
# 일반적 인덱싱 (명시적 -> 이름같은 값으로, 묵시적->번호로)
alco2009['Beer'].head(2)

0    1.20
1    1.31
Name: Beer, dtype: float64

In [84]:
alco2009['Total']=0

In [63]:
alco2009.head(2)

     State  Beer  Wine  Spirits  Total
0  Alabama  1.20  0.22     0.58      0
1   Alaska  1.31  0.54     1.16      0

In [28]:
Inflation.index = pd.Index(range(1999,2015))

In [31]:
Inflation.head(2)

1999    2.2
2000    3.4
Name: %, dtype: float64

In [40]:
# 인덱스값으로 Samoa 존재하니?
'Samoa' in alco2009.index

False

In [46]:
# list에서 comprehension
import numpy as np

In [51]:
myList = np.random.randint(1,10,10).tolist()
myList

[8, 6, 4, 7, 1, 7, 8, 1, 6, 2]

In [54]:
[x for x in myList if x >= 5]

[8, 6, 7, 7, 8, 6]